; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v9)
             (pred_4 ?v5 ?v12)
             (pred_9 ?v11 ?v12)
             (pred_6 ?v10 ?v11 )
	     (pred_7 ?v11)
             (pred_11 ?v4)
             (pred_3 ?v5)
             (pred_2 ?v12)
             (pred_5 ?v11)
             (pred_10 ?v5)
             (pred_12 ?v11)
             (pred_8 ))



(:action op_1
:parameters (?v8 ?v3 ?v6 ?v13)
:precondition (and (pred_11 ?v8) (pred_11 ?v3) (pred_3 ?v6) (pred_2 ?v13)
          (pred_1 ?v8 ?v3) (pred_4 ?v6 ?v13)
                   (pred_9 ?v3 ?v13) (pred_7 ?v8) 
                   (pred_5 ?v3) (pred_10 ?v6))
:effect (and  (pred_12 ?v3) (not (pred_5 ?v3))))


(:action op_2
:parameters (?v8 ?v2)
:precondition (and (pred_11 ?v8) (pred_11 ?v2)
               (pred_7 ?v8) (pred_1 ?v8 ?v2) (pred_12 ?v2))
:effect (and (pred_7 ?v2) (not (pred_7 ?v8))))

(:action op_3
:parameters (?v8 ?v6)
:precondition (and (pred_11 ?v8) (pred_3 ?v6) 
                  (pred_7 ?v8) (pred_6 ?v6 ?v8) (pred_8 ))
:effect (and (pred_10 ?v6)
   (not (pred_6 ?v6 ?v8)) (not (pred_8 ))))


(:action op_5
:parameters (?v8 ?v1 ?v7)
:precondition (and (pred_11 ?v8) (pred_3 ?v1) (pred_3 ?v7)
                  (pred_7 ?v8) (pred_10 ?v7) (pred_6 ?v1 ?v8))
:effect (and (pred_10 ?v1) (pred_6 ?v7 ?v8)
        (not (pred_10 ?v7)) (not (pred_6 ?v1 ?v8))))

(:action op_4
:parameters (?v8 ?v6)
:precondition (and (pred_11 ?v8) (pred_3 ?v6) 
                  (pred_7 ?v8) (pred_10 ?v6))
:effect (and (pred_8 ) (pred_6 ?v6 ?v8) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_31 obj_04 obj_28 obj_12 obj_01 obj_21 obj_19 obj_14 obj_27 obj_24 obj_23 obj_17 obj_29 obj_25 obj_02 obj_13 obj_18 obj_26 obj_20 obj_07 obj_06 obj_11 obj_22 obj_30
    obj_05 obj_10 obj_15
    obj_16 obj_08 obj_09
    )

    (:init
       (pred_8)

       (pred_11 obj_03)
       (pred_11 obj_31)
       (pred_11 obj_04)
       (pred_11 obj_28)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_21)
       (pred_11 obj_19)
       (pred_11 obj_14)
       (pred_11 obj_27)
       (pred_11 obj_24)
       (pred_11 obj_23)
       (pred_11 obj_17)
       (pred_11 obj_29)
       (pred_11 obj_25)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_18)
       (pred_11 obj_26)
       (pred_11 obj_20)
       (pred_11 obj_07)
       (pred_11 obj_06)
       (pred_11 obj_11)
       (pred_11 obj_22)
       (pred_11 obj_30)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_3 obj_09)

       (pred_1 obj_03 obj_01)
       (pred_1 obj_03 obj_31)
       (pred_1 obj_31 obj_21)
       (pred_1 obj_31 obj_04)
       (pred_1 obj_31 obj_03)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_28)
       (pred_1 obj_04 obj_31)
       (pred_1 obj_28 obj_14)
       (pred_1 obj_28 obj_12)
       (pred_1 obj_28 obj_04)
       (pred_1 obj_12 obj_27)
       (pred_1 obj_12 obj_28)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_21)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_21 obj_23)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_31)
       (pred_1 obj_21 obj_01)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_14 obj_29)
       (pred_1 obj_14 obj_27)
       (pred_1 obj_14 obj_28)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_27 obj_25)
       (pred_1 obj_27 obj_12)
       (pred_1 obj_27 obj_14)
       (pred_1 obj_24 obj_02)
       (pred_1 obj_24 obj_23)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_23 obj_13)
       (pred_1 obj_23 obj_17)
       (pred_1 obj_23 obj_21)
       (pred_1 obj_23 obj_24)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_17 obj_29)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_23)
       (pred_1 obj_29 obj_26)
       (pred_1 obj_29 obj_25)
       (pred_1 obj_29 obj_14)
       (pred_1 obj_29 obj_17)
       (pred_1 obj_25 obj_20)
       (pred_1 obj_25 obj_27)
       (pred_1 obj_25 obj_29)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_24)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_13 obj_23)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_18 obj_26)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_26 obj_22)
       (pred_1 obj_26 obj_20)
       (pred_1 obj_26 obj_29)
       (pred_1 obj_26 obj_18)
       (pred_1 obj_20 obj_30)
       (pred_1 obj_20 obj_25)
       (pred_1 obj_20 obj_26)
       (pred_1 obj_07 obj_06)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_22 obj_30)
       (pred_1 obj_22 obj_26)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_30 obj_20)
       (pred_1 obj_30 obj_22)
       (pred_5 obj_02)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_9  obj_02 obj_05)
       (pred_9  obj_24 obj_10)
       (pred_9  obj_29 obj_15)
       (pred_12 obj_03)
       (pred_12 obj_31)
       (pred_12 obj_04)
       (pred_12 obj_28)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_21)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_12 obj_27)
       (pred_12 obj_23)
       (pred_12 obj_17)
       (pred_12 obj_25)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_26)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_22)
       (pred_12 obj_30)

       (pred_4  obj_16 obj_05)
       (pred_4  obj_08 obj_10)
       (pred_4  obj_09 obj_15)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_08 obj_30)
       (pred_6 obj_09 obj_22)
       (pred_7 obj_26)
    )

    (:goal (and
       (pred_6 obj_16 obj_28)
       (pred_6 obj_09 obj_17)
    ))
(:constraints
  (always (not (pred_7 obj_18)))
)
)

; plan
1. (op_2 obj_26 obj_22)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_22)
   goals met: 0 of 2
2. (op_3 obj_22 obj_09)
   deleted: (pred_6 obj_09 obj_22) (pred_8)
   added: (pred_10 obj_09)
   goals met: 0 of 2
3. (op_2 obj_22 obj_26)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_26)
   goals met: 0 of 2
4. (op_1 obj_26 obj_29 obj_09 obj_15)
   deleted: (pred_5 obj_29)
   added: (pred_12 obj_29)
   goals met: 0 of 2
5. (op_2 obj_26 obj_29)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_29)
   goals met: 0 of 2
6. (op_2 obj_29 obj_17)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_17)
   goals met: 0 of 2
7. (op_5 obj_17 obj_16 obj_09)
   deleted: (pred_10 obj_09) (pred_6 obj_16 obj_17)
   added: (pred_10 obj_16) (pred_6 obj_09 obj_17)
   goals met: 1 of 2
8. (op_2 obj_17 obj_19)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_19)
   goals met: 1 of 2
9. (op_2 obj_19 obj_04)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_04)
   goals met: 1 of 2
10. (op_2 obj_04 obj_28)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_28)
   goals met: 1 of 2
11. (op_4 obj_28 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_8) (pred_6 obj_16 obj_28)
   goals met: 2 of 2
